In [3]:
import numpy as np
import pandas as pd

연습 문제 4.1.1

(1) 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.

(2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [3]:
s1 = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s1

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [4]:
s2 = pd.Series([9631482, 3393191, 2632035, 1490158],
              index=["서울", "부산", "인천", "대전"])
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [7]:
s1 + s2

대구           NaN
대전           NaN
부산     6841928.0
서울    19535794.0
인천     5522486.0
dtype: float64

In [6]:
s1 - s2

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [8]:
s1 * s2

대구             NaN
대전             NaN
부산    1.170222e+13
서울    9.539320e+13
인천    7.607768e+12
dtype: float64

In [9]:
s1 / s2

대구         NaN
대전         NaN
부산    1.016370
서울    1.028327
인천    1.098181
dtype: float64

다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

(1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.

(2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [38]:
data = {
    '번호': [1, 2, 3, 4, 5],
    '나이': [23, 23, 25, 27, 29],
    '키': [161.3, 170.5, 165.7, 175.8, 181.3],
    '성별': ['Female', 'male', 'Female', 'male', 'male'],
    '생일': [990111, 990320, 970728, 950915, 931129]}
index = ['춘향','몽룡','향단','방자','사또']
df = pd.DataFrame(data, index=index, )

df

    번호  나이      키      성별      생일
춘향   1  23  161.3  Female  990111
몽룡   2  23  170.5    male  990320
향단   3  25  165.7  Female  970728
방자   4  27  175.8    male  950915
사또   5  29  181.3    male  931129

연습 문제 4.1.3

다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

In [4]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [6]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df.수학

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [7]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [18]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df['평균'] = df.mean(axis=1).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [19]:
df['평균2'] = np.mean(df.values[:,:-1], axis=1).round(2)       # df.values = Numpy 배열
df

    국어  영어  수학     평균    평균2
춘향  80  90  90  86.67  86.67
몽룡  90  70  60  73.33  73.33
향단  70  60  80  70.00  70.00
방자  30  40  70  46.67  46.67

In [21]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df.drop(columns=['평균','평균2'], inplace=True)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  80  70

In [22]:
df['영어']['방자'] = 80
df['평균'] = df.mean(axis=1).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [23]:
# warning message를 보고 싶지 않으면
import warnings
warnings.filterwarnings('ignore')

In [24]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
df.head(1)

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [25]:
df.head(3).tail(1)

    국어  영어  수학    평균
향단  70  60  80  70.0

In [27]:
df.T[['춘향']]

       춘향
국어  80.00
영어  90.00
수학  90.00
평균  86.67

In [28]:
df[:'춘향']

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [29]:
# (6) 향단의 점수를 시리즈로 나타낸다.
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

연습 문제 4.3.1

(1) 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.

(2) 10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [98]:
df = pd.DataFrame(np.arange(10, 35).reshape(5, 5),
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['A', 'B', 'C', 'D', 'E'])
df

    A   B   C   D   E
a  10  11  12  13  14
b  15  16  17  18  19
c  20  21  22  23  24
d  25  26  27  28  29
e  30  31  32  33  34

In [99]:
df.loc['a']

A    10
B    11
C    12
D    13
E    14
Name: a, dtype: int32

In [100]:
df.loc['e']

A    30
B    31
C    32
D    33
E    34
Name: e, dtype: int32

In [88]:
df.loc["b":"c"]

    A   B   C   D   E
b  15  16  17  18  19
c  20  21  22  23  24

In [91]:
df["a":"c"]

    A   B   C   D   E
a  10  11  12  13  14
b  15  16  17  18  19
c  20  21  22  23  24

In [97]:
df.loc[['b', 'd']]

    A   B   C   D   E
b  15  16  17  18  19
d  25  26  27  28  29

In [92]:
df.loc[df.A > 15]

    A   B   C   D   E
c  20  21  22  23  24
d  25  26  27  28  29
e  30  31  32  33  34

In [96]:
df.loc[:'c']

    A   B   C   D   E
a  10  11  12  13  14
b  15  16  17  18  19
c  20  21  22  23  24

In [101]:
df.loc[['a', 'b'], ['B', 'D']]

    B   D
a  11  13
b  16  18

In [102]:
df.iloc[-1]

A    30
B    31
C    32
D    33
E    34
Name: e, dtype: int32

In [103]:
df.iloc[-1] = df.iloc[-1] * 2
df

    A   B   C   D   E
a  10  11  12  13  14
b  15  16  17  18  19
c  20  21  22  23  24
d  25  26  27  28  29
e  60  62  64  66  68